<template>
  <div class="container">
    <div class="item">
      <p class="title text-36">Внутреннее оснащение</p>
      <div class="separator"></div>
      <p class="text-16">
        Корпус бани выполнен из качественной древесины ели, собранной по надежной системе «лунный
        паз», что обеспечивает отличную теплоизоляцию. Для долговечности и эстетики, корпус снаружи
        обработан защитными составами (цвет на выбор клиента), а верхняя часть бочки покрыта мягкой
        черепицей (доступны зеленый, красный или коричневый цвета). Устойчивость конструкции
        обеспечивают три подставки из бруса. <br /><br />

        <span class="text-16 bold">Двери и Электрика</span> <br />
        Входная дверь выполнена из массива древесины и комплектуется ручками и наличниками. Дверь в
        парилку изготовлена из массива липы. Проведена полная электрическая проводка под ключ: в
        каждом отделении установлены лампочка с плафоном, розетка и выключатель.
      </p>
    </div>
    <div class="item">
      <p class="title text-36">Характеристики</p>
      <div class="separator"></div>
      <p class="text-16">
        Размеры - 5х10 <br />
        Площадь помещений - 29 м² <br />
        Пятно застройки - 50 м² <br />
        Этажность - 1 <br />
        Технология - Клееный брус
      </p>
    </div>
    <div class="item">
      <p class="title text-36">Комплектация</p>
      <div class="separator"></div>
      <div class="text-16">
        Внутри баня полностью оборудована для комфортного парения: <br />
        <ul>
          <li>Дровяная печь поставляется в сборе с дымоходом.</li>
          <li>Установлен бак для воды из нержавеющей стали с краном, объемом 50 литров.</li>
          <li>
            В парилке и предбаннике уложены трапики и установлены пологи (2 шт.) и скамейки (2 шт. в
            предбаннике).
          </li>
          <li>
            В парилку и предбанник установлены открывающиеся окна со стеклопакетами (по 1 шт. в
            каждом отделении).
          </li>
          <li>Для слива воды в парилке предусмотрено специальное сливное отверстие.</li>
          <li>В комплект включены камни для каменки (100–60 кг).</li>
        </ul>
      </div>
    </div>
  </div>
</template>

<script setup></script>

<style scoped lang="scss">
@use '@scss/variables' as *;

.container {
  display: grid;
  padding: 0 60px;
  grid-template-columns: 568fr 328fr 448fr;
  gap: 32px;

  .item {
    display: flex;
    flex-direction: column;
    gap: 10px;

    .separator {
      width: 100%;
      height: 1px;
      background: #d9d9d9;
    }

    .text-16.bold {
      font-weight: 700;
    }

    .text-16 {
      ul {
        padding-left: 20px;
        li {
          list-style: disc;
        }
      }
    }
  }
}
</style>
